app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function update()
    {
        $user = $this->userModel->find(user_id());

UPDATE `users` SET `profile` = 'uploads/samsudin/profile/1699124237_bb5b7cb397b86d70b51b.png', `name` = 'Samsudin Aja', `updated_at` = '2023-11-04 18:57:17'
WHERE `users`.`id` IN ('2')
---
        }

        $this->userEntities->name = $this->request->getVar('name');
        $this->userModel->update(user_id(), $this->userEntities);