app/Models/Comment.php

    public function getComment($id)
    {
        $data =  $this->select('id_comment, comment, comments.created_at, users.name, profile, file')
            ->join('users', 'comments.id_user = users.id', 'left')->where('id_postingan', $id)->findAll();
---
SELECT `id_comment`, `comment`, `comments`.`created_at`, `users`.`name`, `profile`, `file`
FROM `comments`
LEFT JOIN `users` ON `comments`.`id_user` = `users`.`id`
WHERE `id_postingan` = '5'