app/Models/Postingan.php

    public function getPostingan($id = null)
    {
        if ($id == null) {
            $data = $this->select('id_postingan, judul,postingan, postingan.file, users.name, postingan.created_at, profile')
                ->join('users', 'postingan.id_user = users.id', 'inner')->orderBy('postingan.created_at', 'desc')->findAll();
        } else {
            $data = $this->select('id_postingan, judul,postingan, postingan.file, users.name, postingan.created_at, profile')
                ->join('users', 'postingan.id_user = users.id', 'inner')->orderBy('postingan.created_at', 'desc')->where('id_user', $id)->findAll();
---
SELECT `id_postingan`, `judul`, `postingan`, `postingan`.`file`, `users`.`name`, `postingan`.`created_at`, `profile`
FROM `postingan`
INNER JOIN `users` ON `postingan`.`id_user` = `users`.`id`
ORDER BY `postingan`.`created_at` DESC
SELECT `id_postingan`, `judul`, `postingan`, `postingan`.`file`, `users`.`name`, `postingan`.`created_at`, `profile`
FROM `postingan`
INNER JOIN `users` ON `postingan`.`id_user` = `users`.`id`
WHERE `id_user` = '1'
ORDER BY `postingan`.`created_at` DESC

    public function detailPostingan($id)
    {
        $data = $this->select('id_postingan, judul,postingan, postingan.file, users.name, postingan.created_at, profile')
            ->join('users', 'postingan.id_user = users.id', 'inner')->find($id);
---
SELECT `id_postingan`, `judul`, `postingan`, `postingan`.`file`, `users`.`name`, `postingan`.`created_at`, `profile`
FROM `postingan`
INNER JOIN `users` ON `postingan`.`id_user` = `users`.`id`
WHERE `postingan`.`id_postingan` = '1'